yaminsadik/led-orchestra/matter-prototype/led-node/sdkconfig.defaults
# ESP32-C6 Matter-over-Thread LED node prototype target.
CONFIG_IDF_TARGET="esp32c6"
# Deployment standard is ESP32-C6-WROOM-1-N8 (8 MB) — see
# docs/led-node-flash-sizing-decision.md. For 4 MB (N4) units, set _4MB here and
# point CONFIG_PARTITION_TABLE_CUSTOM_FILENAME back at partitions.csv.
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y
CONFIG_LIBSODIUM_USE_MBEDTLS_SHA=y
CONFIG_MBEDTLS_HKDF_C=y

CONFIG_BT_ENABLED=y
CONFIG_BT_NIMBLE_ENABLED=y
CONFIG_BT_NIMBLE_EXT_ADV=n
CONFIG_USE_BLE_ONLY_FOR_COMMISSIONING=n

CONFIG_OPENTHREAD_ENABLED=y
CONFIG_OPENTHREAD_SRP_CLIENT=y
CONFIG_OPENTHREAD_DNS_CLIENT=y
CONFIG_OPENTHREAD_LOG_LEVEL_DYNAMIC=n
CONFIG_OPENTHREAD_LOG_LEVEL_NOTE=y
CONFIG_OPENTHREAD_CLI=n

CONFIG_LWIP_IPV6_AUTOCONFIG=n
CONFIG_LWIP_IPV6_NUM_ADDRESSES=8
CONFIG_LWIP_MULTICAST_PING=y
CONFIG_USE_MINIMAL_MDNS=n
CONFIG_ENABLE_EXTENDED_DISCOVERY=y
CONFIG_ENABLE_WIFI_STATION=n

CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions-8mb.csv"

CONFIG_ENABLE_CHIP_SHELL=y

CONFIG_LED_ORCHESTRA_NODE_ID=1
CONFIG_LED_ORCHESTRA_LED_GPIO=2
# LED_COUNT is the per-node renderer BUFFER CAP (max LEDs any single node can
# drive), NOT a fleet-wide constant: the same firmware serves a 400-LED node and a
# 900-LED node. Each node's actual count is provisioned at runtime via SetNodeConfig
# (segment_len, persisted in NVS) and clamped to this cap (see renderer.cpp). Only
# raise this value + the Kconfig `range` and rebuild if a node must drive MORE LEDs
# than this. SEGMENT_*/TOTAL below are first-boot defaults until a node is provisioned.
CONFIG_LED_ORCHESTRA_LED_COUNT=900
CONFIG_LED_ORCHESTRA_SEGMENT_START=0
CONFIG_LED_ORCHESTRA_SEGMENT_LENGTH=900
CONFIG_LED_ORCHESTRA_TOTAL_LEDS=900

# LED node is the Matter OTA Requestor: it pulls signed/encrypted images from
# the hub OTA Provider over the offline Thread fabric (the OTA phase). Keep the
# requestor cluster available early, but leave encrypted-image plumbing for the
# OTA phase so this prototype app does not require a PEM key blob. Matter fabric
# credentials and firmware image signing/encryption are separate security layers.
CONFIG_ENABLE_OTA_REQUESTOR=y
CONFIG_ENABLE_ENCRYPTED_OTA=n

# Brick protection for field-installed nodes. With rollback enabled the bootloader
# boots a freshly-applied OTA image in PENDING_VERIFY; if the app never confirms it
# (see the Thread-attach health gate in app_main.cpp) the bootloader reverts to the
# last-known-good slot on the next reset. This is keep-last-valid extended to
# firmware: a bad OTA can no longer brick a node we can't reach over USB.
# NOTE: CONFIG_BOOTLOADER_APP_ANTI_ROLLBACK (secure-version downgrade prevention)
# stays OFF — it is a field-security item that ships with secure boot / signed
# images, and enabling it without that flow can permanently lock out recovery.
CONFIG_BOOTLOADER_APP_ROLLBACK_ENABLE=y

# Point CHIP at the LED-node project config so the Matter device software version
# comes from CONFIG_LED_ORCHESTRA_SW_VERSION (bump it for every OTA target build).
CONFIG_CHIP_PROJECT_CONFIG="main/matter_project_config.h"
